In [1]:
import sqlite3
import pandas as pd

In [2]:
data = {
    'title': ['Inception', 'Interstellar', 'The Matrix'],
    'year': [2010, 2014, 1999],
    'score': [8.8, 8.6, 8.7]
}

df = pd.DataFrame(data)

In [3]:
# Create or connect to a SQLite database
conn = sqlite3.connect('movies.db')

# Save the DataFrame to a table named 'movies'
df.to_sql('movies', conn, if_exists='replace', index=False)

# Save the DataFrame to a table named 'movies'
df.to_sql('movies2', conn, if_exists='replace', index=False)

# Optional: Close the connection
conn.close()

In [4]:
# Reconnect and read the table back into a DataFrame
conn = sqlite3.connect('movies.db')
df_loaded = pd.read_sql('SELECT * FROM movies', conn)
print(df_loaded)
conn.close()

          title  year  score
0     Inception  2010    8.8
1  Interstellar  2014    8.6
2    The Matrix  1999    8.7

In [5]:
import datetime
# Prepare metadata
timestamp = datetime.datetime.now().strftime("%Y-%m-%d %I:%M:%S %p")

print(timestamp)

2025-04-29 06:14:04 PM

In [1]:
import sqlite3
import pandas as pd

# Connect to your SQLite database
conn = sqlite3.connect("database/drone_data.db")
cursor = conn.cursor()

# 1. List all tables in the database
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()
print("Tables in the database:")
for t in tables:
    print("-", t[0])  # t is a tuple like ('table_name',)

# 2. Read contents of each table
for t in tables:
    table_name = t[0]
    print(f"\n--- Contents of table: {table_name} ---")
    df = pd.read_sql_query(f"SELECT * FROM '{table_name}'", conn)
    display(df)  # Show only the first few rows

Tables in the database:
- 6a383948_111d_4977_b883_9f72e32a1f8c
- metadata
- d3dc0f91_03b5_45f8_b6b5_63e6c7ba6082
- 60e7553b_73ba_4ab0_8c88_f339a5cce55e
- ab2534c8_5dc3_4172_9f70_b0285e073ef7
- 16ad2ab4_3efc_41a9_85c5_9ad34adafde2

--- Contents of table: 6a383948_111d_4977_b883_9f72e32a1f8c ---

   time pressure  depth
0  1000   993.90  -0.19
1  1100   994.02  -0.23
2  1200   993.85  -0.17

--- Contents of table: metadata ---

,table_name,timestamp,image
0,6a383948_111d_4977_b883_9f72e32a1f8c,2025-04-29 06:13:41 PM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...
1,d3dc0f91_03b5_45f8_b6b5_63e6c7ba6082,2025-05-01 07:38:26 PM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...
2,60e7553b_73ba_4ab0_8c88_f339a5cce55e,2025-05-31 07:59:24 PM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...
3,ab2534c8_5dc3_4172_9f70_b0285e073ef7,2025-05-31 08:05:36 PM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...
4,16ad2ab4_3efc_41a9_85c5_9ad34adafde2,2025-06-02 05:10:10 PM,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...

--- Contents of table: d3dc0f91_03b5_45f8_b6b5_63e6c7ba6082 ---

   Seconds Height    Speed
0        1   5 ft  0.5 m/s
1        2   5 ft  0.6 m/s
2        3   6 ft  0.7 m/s
3        4   6 ft  0.8 m/s
4        5   6 ft  0.9 m/s
5        6   7 ft  1.0 m/s
6        7   7 ft  1.1 m/s
7        8   8 ft  1.2 m/s
8        9   9 ft  1.3 m/s
9       10   9 ft  1.4 m/s
10      11  10 ft  1.5 m/s
11      12  10 ft  1.6 m/s

--- Contents of table: 60e7553b_73ba_4ab0_8c88_f339a5cce55e ---

   time pressure  depth
0  1000   993.90  -0.19
1  1100   994.02  -0.23
2  1200   993.85  -0.17

--- Contents of table: ab2534c8_5dc3_4172_9f70_b0285e073ef7 ---

   time pressure  depth
0  1000   993.90  -0.19
1  1100   994.02  -0.23
2  1200   993.85  -0.17

--- Contents of table: 16ad2ab4_3efc_41a9_85c5_9ad34adafde2 ---

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    Diana   28
4    Ethan   35